Revit 2016 API
DividedSurface Properties
The DividedSurface type exposes the following members.
Properties
Name | Description
AllGridRotation
Angle of rotation applied to the U- and V- directions together.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BorderTile
Determines the handling of tiles that overlap the surface's boundary.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
ComponentRotation
The rotation of the pattern by a multiple of 90 degrees.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Host
The element whose surface has been divided.
HostReference
A reference to the divided face on the host.
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsComponentFlipped
Whether the pattern is flipped.
IsComponentMirrored
Whether the pattern is mirror-imaged.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Name
A human readable name for the Element.
 (Inherited from Element.)
NumberOfUGridlines
Get the number of U-gridlines used on the surface.
NumberOfVGridlines
Get the number of V-gridlines used on the surface.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
UPatternIndent
The offset applied to the pattern by an integral number of grid nodes in the U-direction.
USpacingRule
Access to the rule for laying out the first series of equidistant parallel lines on the surface.
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
VPatternIndent
The offset applied to the pattern by an integral number of grid nodes in the V-direction.
VSpacingRule
Access to the rule for laying out the second series of equidistant parallel lines on the surface.
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
DividedSurface Class
Autodesk.Revit.DB Namespace